Revit 2027 API
Visibility Enumeration
Describes the visibility of a particular geometry object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum Visibility
Public Enumeration Visibility
public enum class Visibility
type Visibility
Members
Member name | Value | Description
Contextual | 2 | The geometry object is visible in some contexts, but not in others. This type of geometry is always returned by Geometry[Options], even when Revit is in a context where the geometry should not be visible, but only if IncludeNonVisibleObjects is true. Examples of geometry of this class include Solids representing insulation and lining for MEP ducts and pipes.
Highlight | 1 | The geometry object is visible, but is affected by highlight or prehighlight special coloration. This type of geometry is returned by Geometry[Options] if IncludeNonVisibleObjects is true.
Invisible | 3 | The geometry object is never visible. This type of geometry is never returned by Geometry[Options] but may be obtained by other API operations.
Visible | 0 | The geometry object is always visible. This type of geometry is always returned by Geometry[Options]
See Also
Reference
Autodesk.Revit.DB Namespace